
[CorpseAdventTrooper X2ItemTemplate]
FriendlyName="Trooper Corpse"
FriendlyNamePlural="Trooper Corpses"
BriefSummary="Passable as human when hidden behind their armor, in death the alien features and orange blood of the ADVENT troopers reveal a more sinister pedigree." 

[CorpseAdventOfficer X2ItemTemplate]
FriendlyName="Officer Corpse"
FriendlyNamePlural="Officer Corpses"
BriefSummary="Despite the heavier ornamentation on their battle armor, the bodies of ADVENT Officers are indistinguishable from regular troopers save for a thick red scar on the back of their skulls." 

[CorpseAdventTurret X2ItemTemplate]
FriendlyName="ADVENT Turret Wreck"
FriendlyNamePlural="ADVENT Turret Wrecks"
BriefSummary="Reinforced armor plating has kept the wrecks of these turrets mostly intact after combat, but their inner workings are heavily damaged, likely the result of internal self-destruction charges."

[CorpseAdventStunLancer X2ItemTemplate]
FriendlyName="Lancer Corpse"
FriendlyNamePlural="Lancer Corpses"
BriefSummary="As rigor mortis sets in, the lips of Stun Lancers invariably peel back into a garish grin, likely a reflexive result due to dangerous doses of combat stimulants taken before battle."

[CorpseAdventPurifier X2ItemTemplate]
FriendlyName="Purifier Corpse"
FriendlyNamePlural="Purifier Corpses"
BriefSummary="The bodies of the ADVENT Purifiers are covered in burn scars. At first inspection, a pattern to the scarring indicates that not all of the wounds are accidental, but whether such intentional burns are part of the Purifiers initial training, or whether they are acquired later in the field would be difficult to say."

[CorpseAdventPriest X2ItemTemplate]
FriendlyName="Psionic Corpse"
FriendlyNamePlural="Psionic Corpses"
BriefSummary="Concealed beneath their body armor, the skin of the ADVENT Priests is decorated with intricate spiraling designs whose meaning we can only guess at.  Medical injection ports appear to have been permanently grafted into the skin of the priests' backs and thighs.  At each of these locations, a web of blood vessels shine through the skin with a faint purple glow."

[CorpseAdventShieldbearer X2ItemTemplate]
FriendlyName="Shieldbearer Corpse"
FriendlyNamePlural="Shieldbearer Corpses"
BriefSummary="These cadavers exhibit far more muscle and bone density than other ADVENT bodies we've recovered, and remain surprisingly warm to the touch for hours after their death" 

[CorpseAdventPsiWitch X2ItemTemplate]
FriendlyName="Avatar Corpse"
FriendlyNamePlural="Avatar Corpses"
BriefSummary="This body exhibits no signs of decomposition, and initial scans show a disconcerting level of lower-order brain activity. Reports of auditory hallucinations from the staff that handled this specimen are disturbing, but as yet they are unsubstantiated."

[CorpseAdventMEC X2ItemTemplate]
FriendlyName="ADVENT MEC Wreck"
FriendlyNamePlural="ADVENT MEC Wrecks"
BriefSummary="Much of the articulation, weapon and power systems that comprise these \"MEC\" units bear a striking similarity to early robotic combat prototypes devised by the late Dr. Shen."

[CorpseSectoid X2ItemTemplate]
FriendlyName="Sectoid Corpse"
FriendlyNamePlural="Sectoid Corpses"
BriefSummary="Expired sectoids tend to shrivel and curl in on themselves like spiders, regaining some likeness to the smaller, more feral creatures that we faced in the first war." 

[CorpseAndromedon X2ItemTemplate]
FriendlyName="Andromedon Wreck"
FriendlyNamePlural="Andromedon Wrecks"
BriefSummary="The \"pilot\" organism of the Andromedon battle suit appears surprisingly frail, and smolders faintly when exposed to our seemingly toxic environment."  

[CorpseViper X2ItemTemplate]
FriendlyName="Viper Corpse"
FriendlyNamePlural="Viper Corpses"
BriefSummary="The Vipers' powerful tail muscles continue to clench reflexively for hours after their death, though precautionary brain imaging shows no trace of higher-order function." 

[CorpseArchon X2ItemTemplate]
FriendlyName="Archon Corpse"
FriendlyNamePlural="Archon Corpses"
BriefSummary="Beneath its elegant exterior, the Archon is a surprisingly haphazard combination of flesh and metal."

[CorpseMuton X2ItemTemplate]
FriendlyName="Muton Corpse"
FriendlyNamePlural="Muton Corpses"
BriefSummary="Hidden beneath their battle armor, intricate tattoos and ritualized scarring make clear the Muton's continuing dedication to their tribal hierarchy." 

[CorpseChryssalid X2ItemTemplate]
FriendlyName="Chryssalid Corpse"
FriendlyNamePlural="Chryssalid Corpses"
BriefSummary="The extreme toxicity of the Chryssalid venom requires individual specimen storage in reinforced caskets, each of which have been securely padlocked upon the advice of veteran combat staff." 

[CorpseSectopod X2ItemTemplate]
FriendlyName="Sectopod Wreck"
FriendlyNamePlural="Sectopod Wrecks"
BriefSummary="Behind the utilitarian and nearly featureless outer plating of the Sectopod lies an almost delicate frame of alien alloys hung with countless clusters of targeting computers and elerium power nodes."

[CorpseFaceless X2ItemTemplate]
FriendlyName="Faceless Corpse"
FriendlyNamePlural="Faceless Corpses"
BriefSummary="Requiring storage in sealed medical-grade vats, whatever remains the Faceless leave behind dissolve rapidly into a foul smelling paste."

[CorpseCyberus X2ItemTemplate]
FriendlyName="Codex Brain"
FriendlyNamePlural="Codex Brains"
BriefSummary="The Codex leaves only this small, nearly featureless \"brain\" when it expires, which has proven remarkably resistant to biological or mechanical scans of any kind."

[CorpseGatekeeper X2ItemTemplate]
FriendlyName="Gatekeeper Shell"
FriendlyNamePlural="Gatekeeper Shells"
BriefSummary="The organism within the Gatekeeper's shell is highly unusual, seemingly reliant on the shell itself for sensory input. Long sequences of engraved symbols not unlike ancient hieroglyphs adorn the inner lining of the shell."

[CorpseBerserker X2ItemTemplate]
FriendlyName="Berserker Corpse"
FriendlyNamePlural="Berserker Corpses"
BriefSummary="Long after the massive Berserker has expired, its chemical pumps continue to forcefully inject powerful stimulants and painkillers into its lifeless body." 

[CorpseTheLost X2ItemTemplate]
FriendlyName="The Lost Corpse"
FriendlyNamePlural="The Lost Corpses"
BriefSummary="The Lost, now robbed of whatever life force was animating their desiccated limbs, break apart easily and collapse into a pile of dry, disjointed body parts.  In this state, each Lost corpse looks much like the other, giving no hint of the individual this body had once belonged to."

[CorpseSpectre X2ItemTemplate]
FriendlyName="Spectre Corpse"
FriendlyNamePlural="Spectre Corpses"
BriefSummary="Remarkably, though the Spectre's \"body\" is actually composed of millions of separate nanobots working together in harmony, it retains its singular form even in death.  The nanobots no longer appear to be functioning, but they remain tightly coupled through a surprisingly strong magnetic attraction."
